Revit 2027 API
DisplacementElement.RemoveDisplacedElement Method
 Remove a displaced element from this DisplacementElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveDisplacedElement(
	Element ElemToRemove
)
Public Sub RemoveDisplacedElement (
	ElemToRemove As Element
)
public:
void RemoveDisplacedElement(
	Element^ ElemToRemove
)
member RemoveDisplacedElement :
        ElemToRemove : Element -> unit
Parameters
ElemToRemove Element
 The element to remove.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace